In [1]:
import pandas as pd
import numpy as np
titanic_df = pd.read_csv('/content/drive/MyDrive/Concept and Technologies of AI/Titanic-Dataset.csv')

In [2]:
#Problem1
#Task1
fare = titanic_df[['Fare']]
print("Fare DataFrame")
print(fare.head())

Fare DataFrame
      Fare
0   7.2500
1  71.2833
2   7.9250
3  53.1000
4   8.0500

In [3]:
#Task2
class_age = titanic_df[['Pclass', 'Age']]
print("Pclass and Age DataFrame")
print(class_age.head())

Pclass and Age DataFrame
   Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0
3       1  35.0
4       3  35.0

In [4]:
#Task3
survived_gender = titanic_df[['Survived', 'Sex']]
print("Survived and Sex DataFrame")
print(survived_gender.head())

Survived and Sex DataFrame
   Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

In [5]:
#Problem2
#Task1
fare_gt_100 = titanic_df[titanic_df['Fare'] > 100]
print("Passengers with Fare > 100")
print(fare_gt_100.head())

Passengers with Fare > 100
     PassengerId  Survived  Pclass  \
27            28         0       1
31            32         1       1
88            89         1       1
118          119         0       1
195          196         1       1

                                               Name     Sex   Age  SibSp  \
27                   Fortune, Mr. Charles Alexander    male  19.0      3
31   Spencer, Mrs. William Augustus (Marie Eugenie)  female   NaN      1
88                       Fortune, Miss. Mabel Helen  female  23.0      3
118                        Baxter, Mr. Quigg Edmond    male  24.0      0
195                            Lurette, Miss. Elise  female  58.0      0

     Parch    Ticket      Fare        Cabin Embarked
27       2     19950  263.0000  C23 C25 C27        S
31       0  PC 17569  146.5208          B78        C
88       2     19950  263.0000  C23 C25 C27        S
118      1  PC 17558  247.5208      B58 B60        C
195      0  PC 17569  146.5208          B80        C

In [6]:
#Task2
first_class = titanic_df[titanic_df['Pclass'] == 1]
print("First Class Passengers")
print(first_class.head())

First Class Passengers
    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
11           12         1       1
23           24         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
11                           Bonnell, Miss. Elizabeth  female  58.0      0
23                       Sloper, Mr. William Thompson    male  28.0      0

    Parch    Ticket     Fare Cabin Embarked
1       0  PC 17599  71.2833   C85        C
3       0    113803  53.1000  C123        S
6       0     17463  51.8625   E46        S
11      0    113783  26.5500  C103        S
23      0    113788  35.5000    A6        S

In [7]:
#Task3
female_under_18 = titanic_df[(titanic_df['Age'] < 18) & (titanic_df['Sex'] == 'female')]
print("Female Passengers Under 18")
print(female_under_18.head())

Female Passengers Under 18
    PassengerId  Survived  Pclass                                  Name  \
9            10         1       2   Nasser, Mrs. Nicholas (Adele Achem)
10           11         1       3       Sandstrom, Miss. Marguerite Rut
14           15         0       3  Vestrom, Miss. Hulda Amanda Adolfina
22           23         1       3           McGowan, Miss. Anna "Annie"
24           25         0       3         Palsson, Miss. Torborg Danira

       Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked
9   female  14.0      1      0   237736  30.0708   NaN        C
10  female   4.0      1      1  PP 9549  16.7000    G6        S
14  female  14.0      0      0   350406   7.8542   NaN        S
22  female  15.0      0      0   330923   8.0292   NaN        Q
24  female   8.0      3      1   349909  21.0750   NaN        S

In [8]:
#Subsetting Rows by Categorical Variables
#Task1
embarked_c_or_s = titanic_df[titanic_df['Embarked'].isin(['C', 'S'])]
print("Passengers from Cherbourg or Southampton")
print(embarked_c_or_s.head())

Passengers from Cherbourg or Southampton
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [9]:
#Task2
first_second_class = titanic_df[titanic_df['Pclass'].isin([1, 2])]
print("First and Second Class Passengers")
print(first_second_class.head())

First and Second Class Passengers
    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
9            10         1       2
11           12         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
9                 Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
11                           Bonnell, Miss. Elizabeth  female  58.0      0

    Parch    Ticket     Fare Cabin Embarked
1       0  PC 17599  71.2833   C85        C
3       0    113803  53.1000  C123        S
6       0     17463  51.8625   E46        S
9       0    237736  30.0708   NaN        C
11      0    113783  26.5500  C103        S

In [10]:
#Exploratory Data Analysis Practice
#Exercise - 1
#First question

#1
titanic_df['fare_per_year'] = titanic_df['Fare'] / titanic_df['Age']
#2
high_fare_age = titanic_df[titanic_df['fare_per_year'] > 5]
#3
high_fare_age_srt = high_fare_age.sort_values('fare_per_year', ascending=False)
#4
result = high_fare_age_srt[['Name', 'fare_per_year']]
#5
print("Passengers with High Fare per Year")
print(result)

Passengers with High Fare per Year
                                       Name  fare_per_year
305          Allison, Master. Hudson Trevor     164.728261
297            Allison, Miss. Helen Loraine      75.775000
386         Goodwin, Master. Sidney Leonard      46.900000
164            Panula, Master. Eino Viljami      39.687500
183               Becker, Master. Richard F      39.000000
..                                      ...            ...
318                Wick, Miss. Mary Natalie       5.318281
348  Coutts, Master. William Loch "William"       5.300000
205              Strom, Miss. Telma Matilda       5.231250
813      Andersson, Miss. Ebba Iris Alfrida       5.212500
480          Goodwin, Master. Harold Victor       5.211111

[68 rows x 2 columns]

In [11]:
#Second question

#1
titanic_df['fare_per_class'] = titanic_df['Fare'] / titanic_df['Pclass']
#2
adult_males = titanic_df[(titanic_df['Sex'] == 'male') & (titanic_df['Age'] >= 18)]
#3
adult_males_srt = adult_males.sort_values('fare_per_class', ascending=False)
#4
result = adult_males_srt[['Name', 'Age', 'fare_per_class']]
#5
print("Adult Male Passengers with High Fare per Class")
print(result)

Adult Male Passengers with High Fare per Class
                                   Name   Age  fare_per_class
737              Lesurer, Mr. Gustave J  35.0        512.3292
679  Cardeza, Mr. Thomas Drake Martinez  36.0        512.3292
27       Fortune, Mr. Charles Alexander  19.0        263.0000
438                   Fortune, Mr. Mark  64.0        263.0000
118            Baxter, Mr. Quigg Edmond  24.0        247.5208
..                                  ...   ...             ...
271        Tornquist, Mr. William Henry  25.0          0.0000
179                 Leonard, Mr. Lionel  36.0          0.0000
302     Johnson, Mr. William Cahoone Jr  19.0          0.0000
822     Reuchlin, Jonkheer. John George  38.0          0.0000
806              Andrews, Mr. Thomas Jr  39.0          0.0000

[395 rows x 3 columns]

In [12]:
#Group-by Method Practice Exercise
#Percentage by passenger class
total_fare = titanic_df['Fare'].sum()
first_class_fare = titanic_df[titanic_df['Pclass'] == 1]['Fare'].sum()
second_class_fare = titanic_df[titanic_df['Pclass'] == 2]['Fare'].sum()
third_class_fare = titanic_df[titanic_df['Pclass'] == 3]['Fare'].sum()

fare_totals = [first_class_fare, second_class_fare, third_class_fare]
fare_proportions = [fare / total_fare * 100 for fare in fare_totals]

print(" Percentage of Fare Revenue by Class")
for pclass, proportion in zip([1, 2, 3], fare_proportions):
    print(f"Class {pclass}: {proportion:.2f}%")

 Percentage of Fare Revenue by Class
Class 1: 63.35%
Class 2: 13.25%
Class 3: 23.40%

In [13]:
#Percentage by age group
titanic_df['age_group'] = pd.cut(titanic_df['Age'],
                                  bins=[0, 18, 64, float('inf')],
                                  labels=['child', 'adult', 'senior'])

total_passengers = len(titanic_df)
age_group_counts = titanic_df['age_group'].value_counts()
age_group_proportions = age_group_counts / total_passengers * 100

print("Percentage of Passengers by Age Group")
print(age_group_proportions)

Percentage of Passengers by Age Group
age_group
adult     63.299663
child     15.600449
senior     1.234568
Name: count, dtype: float64